[{"title":"2017年终总结","date":"2018-01-25T01:40:09.000Z","path":"2018/01/25/2017年终总结/","text":"写在前面 17年的年终总结，比往年来的更晚一些，整整晚了20天。没办法，最近状态确实不好。 总结，无外呼两部分：工作和生活，做回顾和定目标，我也不能免俗。 目标定在月亮之上，即使失败了，也可以落在众星之间。 当然了，按照惯例，该扯的淡还是得扯。 生活嘛，谁不是一边怀疑自己，一边努力向前呢！一起总结，一起成长。 工作 在美好的春天，换了城市，换了工作。目前看来，还不错，也有需要改进的地方。 先说好的地方： 住的地方离公司更近了，上下班比之前近了许多，走路10分钟上下班，相比之前确实幸福很多。再也不用高峰期挤公交或者地铁，上次回去又挤了一次，果然还是一样的痛苦。不过，那里就是青春，辛苦点也正常。 管理很宽松，再也不用打卡上下班。基本想下班就可以下班了，加班基本看个人喜好。而且这个公司奇怪的是，个别领导加班比员工还要多。 公司的读书文化是吸引我来这个公司的一大原因，虽然实践中很痛苦，但是收获相对还是比较多的。 技术氛围更宽松，之前的大领导QG走之后，更是如此。当然了，很多时候技术上也很迷茫。 技术上更加注重从整体上进行知识点的总结和积累，也做了不多的几篇分享。主要还是对技术更加焦虑了，没办法，安卓技术更新太快，而我们又太浮躁。 这个月开通了个人博客,目前还没想好放些什么东西在上面，但是多半也是跟工作分享相关的。 不好的是： 在QG离开后，反而更加焦虑，更加迷茫了，虽然更加自由了，感觉像是脱缰的野马，很多时候会迷失方向。 对于Java,对于Android知识体系发现有很多还是不懂或者不了解的，需要补充的依然很多，空杯心态很重要，这一点之前确实很不足。 会真特么多，浪费我写bug的时间。 不要问我为什么这么写，我写bug完全随缘，是缘分让你我站在一起撕逼，是缘分让我在写bug之外有一丝存在感。 XXX(对于公司本来有很多吐槽的地方，不过话到嘴边，想想还是算了，毕竟哪个公司都有这样那样的问题)。 来到新的公司，接触了两个项目，pad项目和ZX项目，不过ZX也只是初期接触了点。 对于pad项目，之前在公司做分享的时候，已经大体总结过了，包括项目定位和技术栈，这里就不赘述了。 对于ZX项目，值得尝试的东西还很多，不过项目组对这块好像规划很不足，只是希望以后会有技术尝试吧。 工作之余，参加了掘金翻译计划，和Android官方文档的捉虫计划，虽然进展不大，但总之是件好事。 展望： 18年要学的东西还很多，Java基础需要巩固，Android基础需要夯实，技术栈需要补充。Web或者python也需要开始慢慢接触，向身边的人学习吧。 分享还是要形成规划，技术类的还是要保持周更，暂定在周六晚上。 《Android开发艺术与探索》、《Effective Java》尽快搞定。 希望把pad项目的架构重构一次，如果领导同意的话。 如果感觉可以了，希望自己再跳一次，多给自己一个机会。 生活 生活方面其实想分享的更多，毕竟很多时候我还是比较感性。想起来多少算多少，慢慢补充吧。 17年看了两部美剧《西部世界》、《无耻家庭》感觉还是不错的，可惜的是「无耻」看到第六部的时候因为女主的某些行为而放弃了,有机会把后面的继续看完吧,毕竟我做事还算是有始有终的。遗憾的是「权游」第7部因为各种原因还没来得及看，18年除了这个想看的还很多。「生活大爆炸」、「老友记」、「废柴联盟」、「硅谷」等。 17年看了许多电影，不过能记起的可能不多。《缝纫机乐队》、《前任3》、《英伦对决》、《追龙》、《亲爱的》、《地球风暴》、《敦刻尔克》等等，只能说世界上好看的电影确实很多，而我们看到的依然是冰山一角。 17年貌似只看了一部综艺《国家宝藏》，确实非常不错，尤其是台词，从文物的层面来了解这个国家的历史，确实是好节目，值得推荐。 17年好听的歌不是很多，但是《失眠》、《成都》、《春风十里》、《逆流时光》、《第三极》、《荣耀》等，首首经典，都在我生命不同阶段感动过我。 17年读了几本书，只能说继续坚持，不放弃。 17年的感情貌似没有什么进展，确实是像很多人说的，年纪越大，越难找到跟你正好合拍的另一个。其实我最近的看法是，年轻的时候我们也不一定能找到，但是相比现在，年轻的时候我们更愿意尝试，更愿意给对方机会，更愿意培养对方成为跟我们合拍的那个人。而现在，我们已经没有时间或者说不愿意花时间去尝试，去给机会(别人和自己)，去培养一段感情。也许原因也很简单，其实我们也一直不知道我们要找什么样的，可是随着岁月的流失，我们越来越知道自己不喜欢什么样的了。其实，我更想说的是，过了青春蛋疼期，单身是真的爽。哈哈，也许我会孤独终老。但是，孤独不好吗？我不知道。 17年的另一个明显变化是，朋友之间的距离越来越远。随着圈子的形成，大家的职业、喜好开始出现了偏差，以前很舒服的关系，现在再待在一起竟然有了尴尬的感觉。所以，痛定思痛，发现了一个让人很难接受的现实，大家的三观早已不同。这个也许是目前我发现的世界上关于友情最无奈的东西了，三观不同，还能做好朋友吗，我不知道，也许也不想知道。 关于朋友，其实还想提一提大师，这个确实不能不提。电视中别人的场景真实地发生在自己身边，说实话还是蛮震撼的。无他，大师的今日昨日情景，和我何其像。只能说，我比他运气稍好一点点，仅此而已。总之，问题很大，而且是不一定哪一天就爆发了。 关于朋友相处之道，还是比较欣赏梅长苏送别萧景睿时说的。 关于健身，对于很多人来说都是一个悲伤的故事。对我也是，当体重达到曾经的目标后，没有觉得有啥好的，反而是感觉身体更不如以往，很多个夜里甚至不能侧躺，想想还真是悲哀。 我们本想琴棋书画诗酒茶，可是长大了，就不得不躺好了，承受生活一番又一番蹂躏。还得爬起来，笑着说：劳资也很爽。笑了一脸，苦了一心。 至于18年的展望，确实还没想好。 最后 扯了半天的淡，总算要收尾了，还是有些许的高兴，些许的伤感。高兴的是，又要完成一篇分享，伤感的是17年，就这样过去了。 对于那些已经离开或者即将离开的朋友，我想说： 朋友啊，很高兴你能来，不遗憾你离开，致那些我们最好的芳华。 我们身处一个伟大的时代，对于我们这一拨人，可能是处于这样一个阶段： 既知晓人类文明的丰富璀璨，又懂得生命路途的坎坷艰难，这样的位置怎样？ 嗯，不错。 就这样吧。 我们身边的很多人，野心大，目标感强，总在寻找下一个进步的方向，想去一个更好的地方。 我们马不停蹄，总以为到了某个点，就会幸福、满足。 可是，好像并不是。 不过，2017年已经过去了，我跟朋友说，2018年会更美好的。 谁不是一边怀疑自己，一边努力向前呢。 阅读原文","tags":[{"name":"2017","slug":"2017","permalink":"http://zhaokeqiang.cn/tags/2017/"},{"name":"年终总结","slug":"年终总结","permalink":"http://zhaokeqiang.cn/tags/年终总结/"}]},{"title":"2018.first","date":"2018-01-17T05:22:58.000Z","path":"2018/01/17/2018-first/","text":"该来的总会来。 心存希望，望眼未来。 坚持走，总有出路。 生活会一直艰难，而不仅仅是过去和现在。 你拥有的只有你自己。","tags":[{"name":"2018","slug":"2018","permalink":"http://zhaokeqiang.cn/tags/2018/"}]},{"title":"Hello World","date":"2018-01-16T10:47:07.118Z","path":"2018/01/16/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]